app/controllers/friends_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "likes" ("created_at", "friend_id", "liked", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-10-22 17:41:24.138010"], ["friend_id", 1], ["liked", "f"], ["updated_at", "2014-10-22 17:41:24.138010"], ["user_id", 2]]
---
  def like
    # get data from like or unlike button
    @friend = User.find(params[:id])
    like_or_unlike  = params[:liked] == "true"

    # save like data into database
    current_user.likes.create(friend_id: @friend.id, liked: like_or_unlike)